Artillery/create_users.yml
config:
  target: "{{ $processEnvironment.gateway_url }}"
  http:
    # Responses have to be sent within 10 seconds or the request will be aborted
    timeout: 10
  phases:
    - duration: 10
      arrivalRate: 1
  payload:
    # path is relative to the location of the test script
    path: "users.csv"
    fields:
      - "username"
      - "password"
    order: sequence
    skipHeader: true
scenarios:
  - flow:
    - post:
        url: "/signup"
        # body: "{\"username\": \" NIssen2 \",\"password\": \"password\" }"
        json:
            username: "{{ username }}"
            password: "{{ password }}"
        gzip: true